DataProcessors/СравнениеУчетныхАвтосФактическими.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СравнениеУчетныхАвтосФактическими</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеСтраницы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладСинхронизации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Автомобили</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОстаткиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАвтомобилей</Name>
			<Comment>Блок учета остатков автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток автомобиля на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию автомобиль</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/КомплектацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>КомплектацияАвтомобилей</Name>
			<Comment>Комплектация автомобилей дополнительным оборудованием</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Comment>Сумма продажи в регламентированной валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажиУпр</Name>
					<Comment>Сумма продажи в управленческой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Опции</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/СравнениеУчетныхАвтосФактическими/Ext/ObjectModule.bsl
//Гэндальф+++
Процедура  ЗагрузитьДанныеИзФайла(Excel)   Экспорт 
      ТЗ = ЗаполнитьТЗ(Excel);   //вариант через com объект
	  
	  Для Каждого стр из ТЗ цикл
		  Если стр.Склад = "" тогда
			  Сообщить("В строке с Вином "+стр.VIN+" не обнаружен склад");
              Продолжить;
		  ИначеЕсли  Склады.Найти(стр.склад, "СкладСинхронизации") = Неопределено тогда
			  Продолжить;
		  КонецЕсли;	                              
		  Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Автомобили.Ссылка
			               |ИЗ
			               |	Справочник.Автомобили КАК Автомобили
			               |ГДЕ
			               |	Автомобили.VIN ПОДОБНО &VIN"; 
			Запрос.УстановитьПараметр("VIN","%" + стр.VIN + "%");	
		Авто	= Запрос.Выполнить().Выбрать();
		Если Авто.Следующий() тогда
			НайденнаяСтрока = Автомобили.Найти(авто.Ссылка, "Автомобиль"); 
			Если НайденнаяСтрока<>Неопределено тогда
				НайденнаяСтрока.Количество = 1;
			Иначе
				НоваяСтрока=Автомобили.Добавить();
				НоваяСтрока.Автомобиль=Авто.Ссылка;
				НоваяСтрока.Количество=1;
				//Если  НоваяСтрока.КоличествоУчет = 1 
				//НоваяСтрока.КоличествоУчет = 0;
				//
				//НоваяСтрока.Сумма = стр.Сумма;

			КонецЕсли;	
				
		Иначе
			Сообщить("Автомоиль с VIN "+стр.VIN+" не обнаружен");
		КонецЕсли;	
		  
	КонецЦикла;	  
КонецПроцедуры
  
Функция ЗаполнитьТЗ(Excel) Экспорт 
	
	
	//****************
	//создадим тз для записи данных
	ТЗ = новый ТаблицаЗначений;
	
	
	ТЗ.Колонки.Добавить("VIN");
	//ТЗ.Колонки.Добавить("Сумма");
	ТЗ.Колонки.Добавить("Склад");
	//ТЗ.Колонки.Добавить("Статус");

	
	VINКолонка =  VIN-1;
	СуммаКолонка = Сумма-1;
	СкладКолонка = Склад-1;
	СтатусКолонка = Статус-1;

	
	//ЭлементыФормы.Индикатор.МаксимальноеЗначение=10000;
	н = 0;
	
	
	//НетСотр = Новый ТаблицаЗначений;
	//НетСотр.Колонки.Добавить("Сотрудник");
	
	//Попытка
	
	Состояние("Чтение документа...");
	
	// используемые объекты
	Соединение = Новый COMОбъект("ADODB.Connection");
	НаборДанных = Новый COMОбъект("ADODB.Recordset");
	Каталог          = Новый COMОбъект("ADOX.Catalog");
	
	// подключение файла данных
	//Соединение.Open("Provider=Microsoft.Jet.OLEDB.4.0;Data Source=" + ПутьКФайлуXLS + ";Extended Properties=""Excel 8.0;IMEX=1;"""); //Это для Эксел 97-2000
	СтрокаСоединения = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source=" + ПутьКФайлу + "; Extended Properties=""Excel 12.0;""";     //Это для Эксел 2010
	//СтрокаСоединения = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source=" + ПутьКФайлуXLS + ";Extended Properties=""Excel 8.0;IMEX=1;""";     //Это для Эксел 2010
	
	Соединение.Open(СтрокаСоединения);
	
	// определение имени листа для выбора данных
	Каталог.ActiveConnection     = Соединение;
	ИмяПервойСтраницы = Каталог.Tables.Item(0).Name;
	
	// получение данных листа
	НаборДанных.Open("
	|Select 
	|          *
	|From ["+НазваниеСтраницы+"$"+"]", 
	Соединение);
	
	ТекущаяСтрока = 1;
	НачальнаяСтрока = 3; //откуда стартуем
	КонечнаяСтрока = 1389; //где заканчиваем (отладка)
	
	// перенос данных в таблицу значений
	Пока Не НаборДанных.EOF Цикл
		Если ТекущаяСтрока >= НачальнаяСтрока - 1 Тогда  
			Проверка = СокрЛП(?(ТипЗнч(НаборДанных.Fields.Item(VIN).Value) <> Тип("Null"), (НаборДанных.Fields.Item(VIN).Value),""));
			
			Если  Проверка = "" тогда
				Прервать;
			КонецЕсли;	
			
			СтрокаТаблицы = ТЗ.Добавить();
			
			СтрокаТаблицы.VIN 	        = СокрЛП(?(ТипЗнч(НаборДанных.Fields.Item(VINКолонка).Value) <> Тип("Null"), (НаборДанных.Fields.Item(VINКолонка).Value),""));
			//СтрокаТаблицы.Сумма	        = СокрЛП(?(ТипЗнч(НаборДанных.Fields.Item(СуммаКолонка ).Value) <> Тип("Null"), (НаборДанных.Fields.Item(СуммаКолонка ).Value),""));
							
			СтрокаТаблицы.Склад 	        = СокрЛП(?(ТипЗнч(НаборДанных.Fields.Item(СкладКолонка).Value) <> Тип("Null"), (НаборДанных.Fields.Item(СкладКолонка).Value),""));
			//СтрокаТаблицы.Статус 	        = СокрЛП(?(ТипЗнч(НаборДанных.Fields.Item(СтатусКолонка).Value) <> Тип("Null"), (НаборДанных.Fields.Item(СтатусКолонка).Value),""));

		КонецЕсли; 
		
		НаборДанных.MoveNext();
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		н = н+1;
		//ЭлементыФормы.Индикатор.Значение = н;
		
	КонецЦикла; 
	
	Соединение.Close();
	Сообщить(н);        
	
	
	//ТЗ.ВыбратьСтроку();
	
	Возврат ТЗ;	
	
КонецФункции




// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="ВалютаДокумента" Тогда
		//Попытка
		//	ТребуетсяПересчет=ДопПараметры.ТребуетсяПересчет;
		//Исключение
		//	ТребуетсяПересчет=Ложь;
		//КонецПопытки; 
		//Рез=Истина;
		//Если ТребуетсяПересчет И (НЕ обЗначениеНеЗаполнено(ТекущаяВалютаДокумента)) Тогда
		//	Для каждого СтрокаТЧ Из Автомобили Цикл
		//		НоваяЦена=обПересчет(СтрокаТЧ.Цена,ТекущаяВалютаДокумента,ТекущийКурсДокумента,ВалютаДокумента,КурсДокумента);
		//		Если НоваяЦена<>СтрокаТЧ.Цена Тогда
		//			СтрокаТЧ.Цена=НоваяЦена;
		//			Рез=ОбработкаРеквизита("Автомобили.Цена",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
		//		КонецЕсли;
		//	КонецЦикла; 
		//КонецЕсли; 
		//ТекущаяВалютаДокумента=ВалютаДокумента;
		//ТекущийКурсДокумента=КурсДокумента;
		//Возврат Рез;
		
	ИначеЕсли Имя="Контрагент" Тогда
		//Если ХозОперация=Справочники.ХозОперации.ИнвентаризацияАвтомобилей Тогда
		//	Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
		//		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
		//		Рез=ОбработкаРеквизита(Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		//	КонецЕсли; 
		//Иначе
		//	Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		//КонецЕсли; 
		//Возврат Рез;
		
	ИначеЕсли Имя="ДоговорВзаиморасчетов" Тогда
		//Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		//// проверим вид договора
		//Если ДоговорВзаиморасчетов.Пустая() Тогда
		//ИначеЕсли НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
		//	Если ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.СКомиссионером И 
		//		 ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.Прочее Тогда
		//		 #Если Клиент Тогда
		//		 Предупреждение("Необходимо выбирать договор комиссии !",10);
		//		 #КонецЕсли
		//		 ДоговорВзаиморасчетов=Неопределено;
		//		 ОбработкаРеквизита("ДоговорВзаиморасчетов",ТекСтрока,ЭтаФорма,ДопПараметры);
		//		 Возврат Ложь;
		//	КонецЕсли; 
		//КонецЕсли;
		//Возврат Рез;
		
	ИначеЕсли Имя="СкладКомпании" Тогда
		//Если НЕ обЗначениеНеЗаполнено(СкладКомпании) Тогда
		//	Если СкладКомпании.Розничный Тогда
		//		#Если Клиент Тогда
		//		Предупреждение("Выбранный склад: """ + СкладКомпании + """ является розничным!
		//		|Выберите оптовый склад",10);
		//		#КонецЕсли
		//		СкладКомпании = Неопределено;
		//	КонецЕсли; 
		//КонецЕсли; 
		//Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		//Если (Автомобили.Количество()>0) И (НЕ обЗначениеНеЗаполнено(СкладКомпании)) Тогда
		//	#Если Клиент Тогда
		//	Если ЭтаФорма<>Неопределено Тогда
		//		Если Вопрос("Произвести пересчет расчетного количества автомобилей", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		//			Для каждого СтрокаТоваров Из Автомобили Цикл
		//				Рез=ОбработкаРеквизита("ПолучитьРасчетноеКоличество",СтрокаТоваров,ЭтаФорма) И Рез;
		//			КонецЦикла; 
		//		КонецЕсли; 
		//	Иначе
		//		Рез=ОбработкаРеквизита("ПолучитьРасчетноеКоличество",СтрокаТоваров,ЭтаФорма) И Рез;
		//	КонецЕсли; 
		//	#Иначе
		//	Рез=ОбработкаРеквизита("ПолучитьРасчетноеКоличество",ТекСтрока,ЭтаФорма) И Рез;
		//	#КонецЕсли
		//КонецЕсли; 
		//Возврат Рез;
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "АВТОМОБИЛИ"
	ИначеЕсли Имя="Автомобили.Автомобиль" Тогда
		// получим расчетное количество
		Возврат ОбработкаРеквизита("ПолучитьРасчетноеКоличество",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Автомобили.Количество" Тогда
		ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
		Возврат Истина;
		
	ИначеЕсли Имя="Автомобили.КоличествоУчет" Тогда
		ТекСтрока.СуммаУчет=ТекСтрока.Цена*ТекСтрока.КоличествоУчет;
		Возврат Истина;
		
	ИначеЕсли Имя="Автомобили.Цена" Тогда
		ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
		ТекСтрока.СуммаУчет=ТекСтрока.Цена*ТекСтрока.КоличествоУчет;
		Возврат Истина;
		
	ИначеЕсли Имя="Автомобили.Сумма" Тогда
		ТекСтрока.Цена=?(ТекСтрока.Количество=0,0,ТекСтрока.Сумма/ТекСтрока.Количество);
		Возврат ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Автомобили.СуммаУчет" Тогда
		ТекСтрока.Цена=?(ТекСтрока.КоличествоУчет=0,0,ТекСтрока.СуммаУчет/ТекСтрока.КоличествоУчет);
		Возврат ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	// ПРОЧИЕ ОБРАБОТЧИКИ
	ИначеЕсли Имя="ПолучитьРасчетноеКоличество" Тогда
		// проверим
		Если обЗначениеНеЗаполнено(ТекСтрока) Тогда Возврат Ложь; КонецЕсли;
		// получаем в зависимости от вида хоз. операции
		//Если ХозОперация<>Справочники.ХозОперации.ИнвентаризацияАвтомобилейОтданныхНаКомиссию Тогда
	        СтруктураОтбора=Новый Структура("СкладКомпании,Автомобиль");
			СтруктураОтбора.СкладКомпании=ТекСтрока.СкладКомпании; СтруктураОтбора.Автомобиль=ТекСтрока.Автомобиль;
			МоментВремени=Новый МоментВремени(КонецДня(Дата));
			ТаблицаОстатков=РегистрыНакопления.ОстаткиАвтомобилей.Остатки(МоментВремени,СтруктураОтбора,,"СуммаУпр,Количество");
			Если ТаблицаОстатков.Количество()>0 Тогда
				ТекСтрока.Цена=обПересчет(ТаблицаОстатков.Итог("СуммаУпр"),Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),Дата,Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),1);
				ТекСтрока.Количество=ТаблицаОстатков.Итог("Количество");
			Иначе
				ТекСтрока.Цена=0;
				ТекСтрока.Количество=0;
			КонецЕсли;
			ТаблицаОстатков=РегистрыНакопления.КомплектацияАвтомобилей.Остатки(МоментВремени,СтруктураОтбора,,"СуммаУпр,Количество");
			Если ТаблицаОстатков.Количество()>0 Тогда
				ТекСтрока.Цена=ТекСтрока.Цена+обПересчет(ТаблицаОстатков.Итог("СуммаУпр"),Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),Дата,Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),1);
			КонецЕсли;
		//Иначе
		//	СтруктураОтбора=Новый Структура("Контрагент,ДоговорВзаиморасчетов,Автомобиль");
		//	СтруктураОтбора.Контрагент=Контрагент; СтруктураОтбора.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
		//	СтруктураОтбора.Автомобиль=ТекСтрока.Автомобиль;
		//	МоментВремени=?(Ссылка.Пустая(),Новый МоментВремени(КонецДня(Дата)),МоментВремени());
		//	ТаблицаОстатков=РегистрыНакопления.АвтомобилиОтданные.Остатки(МоментВремени,СтруктураОтбора,,"СуммаУпр,Количество");
		//	Если ТаблицаОстатков.Количество()>0 Тогда
		//		ТекСтрока.Цена=обПересчет(ТаблицаОстатков.Итог("СуммаУпр"),ВалютаУпр,Дата,ВалютаДокумента,КурсДокумента);
		//		ТекСтрока.Количество=ТаблицаОстатков.Итог("Количество");
		//	Иначе
		//		ТекСтрока.Цена=0;
		//		ТекСтрока.Количество=0;
		//	КонецЕсли;
		//КонецЕсли;
		// пересчет
		Рез=ОбработкаРеквизита("Автомобили.Количество",ТекСтрока,ЭтаФорма,ДопПараметры);
		Если ТекСтрока.КоличествоУчет=0 Тогда ТекСтрока.КоличествоУчет=ТекСтрока.Количество; КонецЕсли;
		Возврат ОбработкаРеквизита("Автомобили.КоличествоУчет",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

//Гэндальф---
